tap "apple/apple"
tap "bendews/tap"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "khanhas/tap"
tap "nikitabobko/tap"
tap "peripheryapp/periphery"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.11"
brew "autojump"
brew "cffi"
brew "aws-sam-cli"
brew "awscli"
brew "black", link: false
brew "glib"
brew "cairo"
brew "carapace"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "ccache"
brew "gdk-pixbuf"
brew "icu4c@77"
brew "harfbuzz"
brew "libavif"
brew "librsvg"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "dfu-util"
brew "fastfetch"
brew "fd"
brew "gcc"
brew "freetds"
brew "fzf"
brew "gd"
brew "git"
brew "gnupg"
brew "gpgme"
brew "gradle"
brew "pkgconf"
brew "guile"
brew "hadolint"
brew "htop"
brew "openjdk"
brew "jdtls"
brew "jenv"
brew "node"
brew "pandoc"
brew "jupyterlab", link: false
brew "kew"
brew "krb5"
brew "lazygit"
brew "libgccjit"
brew "libgit2"
brew "libwebsockets"
brew "llvm"
brew "make"
brew "maven"
brew "mosquitto"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "nvm"
brew "php"
brew "pipes-sh"
brew "pnpm"
brew "poppler"
brew "prettier"
brew "python@3.10"
brew "python@3.12"
brew "python@3.9"
brew "pyyaml", link: false
brew "qemu"
brew "ripgrep"
brew "rust"
brew "shfmt"
brew "six"
brew "socat"
brew "speedtest-cli"
brew "spicetify-cli"
brew "starship"
brew "stylua"
brew "swiftlint"
brew "switchaudio-osx"
brew "telnet"
brew "tmux"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh-vi-mode"
brew "bendews/tap/apw"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "fsouza/prettierd/prettierd"
cask "aerospace"
cask "discord"
cask "font-hack-nerd-font"
cask "font-iosevka-ss04"
cask "ghidra"
cask "notunes"
cask "periphery"
cask "spotify"
cask "temurin"

